admbase/src/Catalogs/УчетныеДанныеПодключений/УчетныеДанныеПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеДанныеПодключений</name>
  <predefined>
    <items>
      <name>DMC</name>
      <description>DMC</description>
    </items>
    <items>
      <name>ERP</name>
      <description>ERP</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипПодключения</name>
    <type>
      <types>EnumRef.ТипыПодключения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорневойURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСервисПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

admbase/src/Catalogs/УчетныеДанныеПодключений/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьCOM(Команда)
	
	Если Модифицированность Тогда
		ВызватьИсключение НСтр("ru = 'Объект модифицирован'; en = 'Object modified'");
	КонецЕсли; 
	
	ПроверитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьWEB(Команда)
	
	Если Модифицированность Тогда
		ВызватьИсключение НСтр("ru = 'Объект модифицирован'; en = 'Object modified'");
	КонецЕсли; 
	
	ПроверитьWEBНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаHTTP(Команда)
	
	Если Модифицированность Тогда
		ВызватьИсключение НСтр("ru = 'Объект модифицирован'; en = 'Object modified'");
	КонецЕсли; 
	
	ПроверкаHTTPНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПроверитьНаСервере()
	
	Соединение = Справочники.УчетныеДанныеПодключений.ПодключитьсяКбазе(Объект.Ссылка);
	
	Если Не Соединение = Неопределено Тогда 
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Соединение выполнено успешно";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьWEBНаСервере()
	
	Попытка 
		
	СтрокаПодключения = СтрШаблон("http://%1/%2/ws/deviation/?wsdl",Объект.WebСервисИмяСервера,Объект.WebСервисИмяБазы);
//	ОпределенияWS 	= Новый WSОпределения(СтрокаПодключения,
//											Объект.WebСервисИмяПользователя,
//											Объект.WebСервисПароль);
																
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Соединение выполнено успешно";
		СообщениеПользователю.Сообщить();

	Исключение
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ОписаниеОшибки();
		СообщениеПользователю.Сообщить();
	КонецПопытки;
	
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаHTTPНаСервере()  
	
	Если  Объект.Ссылка = Справочники.УчетныеДанныеПодключений.ERP Тогда 
		Шаблон = "/%1/hs/root/doc?date=%2";
	Иначе
		Шаблон = "/%1/hs/root/claims?date=%2";
	КонецЕсли;

	ИмяПубликации = "";
	СоединениеHTTP = Справочники.УчетныеДанныеПодключений.ПолучитьСоединениеHTTP(Объект.Ссылка,ИмяПубликации);
	СтрокаПодключения = СтрШаблон(Шаблон,ИмяПубликации,Формат(ДобавитьМесяц(ТекущаяДатаСеанса(),-1),"ДФ=""ггггММдд"""));
	
	ЗапросHTTP = Новый HTTPЗапрос(СтрокаПодключения);
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);

	Если ОтветHTTP.КодСостояния = 200 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Соединение выполнено успешно";
		СообщениеПользователю.Сообщить();
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Соединение HTTP не установлено. Код состояния %1",Строка(ОтветHTTP.КодСостояния));
		СообщениеПользователю.Сообщить();
	КонецЕсли;

	
КонецПроцедуры // ПроверкаHTTPНаСервере()

#КонецОбласти
